<html>          <! Seite 1>
<head>

        <title>Festplatten</title>
        <link rel="stylesheet" href="allgemein-css.css" type="text/css">                         <!Dies ist schon bekannt, die verkn&uuml;pfung zur css datei>
        <link rel="stylesheet" href="menu-css.css" type="text/css">
        <link rel="stylesheet" href="transparenz-css.css" type="text/css">
        <body link="black" alink="#black" vlink="black">
</head>
<body>

         <body background="bilder/hintergrundbild.png">
         <!men&uuml; inspiriert von code-crowd.de>
         <div class="men&uuml;">    <!Hier habe ich eine Klasse erstellt, damit alles in dem Bereich im Weiteren in der Css-Datei sylisch angepasst werden kann>

                 <nav>
                         <ul>     <img src="bilder/Logo.png" alt="" border="0" width="220" height="90">  <!Hier habe ich Bilder mit in das Men&uuml; genommen, damit es nicht so leer aussieht>
                                 <li><a href="Festplatte.html"><img src="bilder/haus.png" alt="" border="0" width="40" height="55"><strong>HOME</strong></a></li>
                                 <li><a href="Register.html"><img src="bilder/Logo Buch.png" alt="" border="0" width="54" height="37">Register</a></li>
                                 <li><a href="Quellen.html"><img src="bilder/Pc.png" alt="" border="0" width="50" height="50">Quellen</a></li>
                                 <li><a href="Impressum.html"><img src="bilder/Telefon.png" alt="" border="0" width="50" height="50">Impressum</a></li>
                                 <li><a href="https://de.wikipedia.org/wiki/Festplatte"><img src="bilder/Wikipedia-logo-v2.svg.png" alt="" border="0" width="45" height="45">Wikipedia</a></li>
                         </ul>
                 </nav>
         </div>
         <br>
         <br>

         <h1><center>
            Festplatte ein Speichermedium </center></h1>

            <br> <br> <br> <br> <br>
            <!Ich wei&szlig; man kann die Position auch in der Css anpassen, wo es stehen soll, aber ich hatte es so am anfang gemacht, also habe ich es gelassen>

              <ul id="inhalt"> <br> <strong>Inhaltsverzeichnis</strong> <br>  <br>
            <li><a href="#zweitens"><strong>1.</strong>Was ist eine Festplatte</a></li><br>
            <!Die #... sind verkn&uuml;pfungen nach unten zu den Textstellen, damit man dort sofort hin gelangen kann, und einen besseren &Uuml;berblick besitzt>
            <li><a href="#drittens"><strong>2.</strong>wie funktioniert eine HDD</a></li><br>
            <li><a href="#viertens"><strong>3.</strong>Wie funktioniert eine SSD</a></li><br>
            <li><a href="#f&uuml;nf"><strong>4.</strong>Geschichte der Festplatte</a></li><br>
            <li><a href="#sechs"><strong>5.</strong>Geschichte der Datenspeicherung vor der Festplatte</a></li><br>
         </ul>
             <br> <br>







         <p id="Text">PCs brauchen mindestens ein Speicherlaufwerk, um funktionieren zu k&ouml;nnen. Ob intern oder extern.</p> <br>



         <p id="zweitens"><strong>Was ist eine Festplatte? </strong>  <br> <br>  <!Hier ist eine Verkn&uuml;pfung zum Inhaltsverzeichnis>

Fast jeder Pc beinhaltet eine interne Festplatte. Sie ist ein <strong>Speichermedium</strong>, also zum speichern von <strong>Dokumenten,
Programmen, Bildern, Videos</strong> und so weiter.
Als „Normale“ Festplatte bezeichnet man die <strong>HDD-Festplatte</strong>,<strong> „Hard Disk Drive“</strong>.
Es gibt noch eine andere Art der Festplatte, die <strong>SSD</strong>, aber die kommt gleich dran.
Man kann mit externen Festplatten <strong>Backups</strong> sichern, oder bei wenig Speicher auf dem Computer einfach die Daten sichern.
Es gibt sie in verschiedenen Speichergr&ouml;&szlig;en.
</p><br>

         <p id="drittens"><strong> Wie funktioniert eine HDD?   </strong><br>  <br>

Bei der HDD-Festplatte ist <img id="Bild" src="bilder/festplatte echt.png" alt="" border="0" width="600" height="300">   ein<strong> magnetisches Speichersystem</strong>, wie bei einer Diskette oder ein Ton- und Videoband eingebaut.
Es drehen sich Scheiben in der Festplatte, die sogenannten<strong> Platten</strong>, auf deren Oberfl&auml;che die Daten gespeichert werden.
Wenn man Informationen schreibt, wird ohne Ber&uuml;hrung die magnetische Oberfl&auml;che der Scheiben dauerhaft magnetisiert. Nun muss man aber auch
die Informationen wieder abrufen k&ouml;nnen, dies gelingt durch einen eingebauten Sensor (Kopfarm), der diese Magnetisierten Scheiben wieder
Ber&uuml;hrungslos abtastet und die Werte in lesbare Dateien umformt.
Um den empfindlichen<strong>Kopfarm </strong> und die Platten zu sch&uuml;tzen ist extra ein <strong>Stahlgeh&auml;use</strong> eingebaut, wodurch
Besch&auml;digungen unter normalen Bedingungen vermieden werden.
Durch diese Teile geh&ouml;rt die HDD zur Kategorie <strong>„Laufwerke“</strong>.  <br>

In der Festplatte werden die Daten in in<strong> Bl&ouml;cken</strong> zusammen gefasst, mit jeweils einer festen Gr&ouml;&szlig;e. Ein Block ist meistens
<strong>512 oder 4096 Byte</strong> gro&szlig;.
Man kann sich das wie eine Stra&szlig;e mit vielen H&auml;usern, die Bl&ouml;cke, vorstellen. Man speichert ein Dokument, dann muss es in ein Haus einziehen,
ist es gr&ouml;&szlig;er als ein Block, muss es noch in das n&auml;chste Haus, bis es vollst&auml;ndig gespeichert wurde. L&ouml;scht man die Dateien ziehen sie aus
den H&auml;usern aus und die sind wieder frei. Wenn sich aber eine Neue Datei aufteilen muss, also das die Datei bei Haus 1, 2 und 5 gespeichert ist,
dauert der Lese-Vorgang l&auml;nger. Um dies zu verhindern sollte man die Festplatte regelm&auml;&szlig;ig <strong>defragmentieren</strong>.
Die Speicherkapazit&auml;t ergibt sich aus der Gr&ouml;&szlig;e eines Blocks<strong> multipliziert </strong>mit der Anzahl an Bl&ouml;cken (H&auml;usern). <br>

Um die Einzelnen Bl&ouml;cke richtig ansteuern zu k&ouml;nne erlaubt ein <strong>Indexsystem </strong>dem Kopfarm das Auffinden aller Dateien.  <br>

Bei den meisten sind die HDD Festplatten <strong>3,5 oder 2,5 Zoll</strong> gro&szlig;. Gro&szlig;e Festplatten sind in Desktop-PCs und kleiner sind in Notebooks verbaut,
wobei dort meist SSDs verbaut sind.

</p> <br>
         <p id="viertens"><strong>Wie Funktioniert eine SSD Festplatte? </strong><br><br>

Neben den normalen HDD Festplatten gibt es <img id="Bild"src="bilder/sssd.png" alt="" border="0" width="400" height="270">auch die modernere auf <strong>Flash-Speicher</strong> basierende SSD Festplatte.
SSD ist kurz f&uuml;r <strong>„Solid State Drive“ </strong>oder <strong>„Solid State Disk“</strong> und ist neben der HDD die weit verbreitete Alternative.

Hier in der SSD gibt es keine Scheiben oder andere bewegliche Teile wie bei der HDD.
Es basiert auch nicht auf einem magnetischen Speichersystem, sondern es ist ein elektronisches Speichermedium, wie etwa ein<strong> USB-Stick.</strong>
Somit ist es viel<strong> robuster</strong> und weniger anf&auml;llig f&uuml;r mechanische Fehler, deshalb sind sie meist in <strong>Notebooks </strong>verbaut. Sie sind leiser
da keine mechanische Technik verbaut ist, sie werden nicht so warm wie die HDD und verbrauchen weniger Strom. Noch dazu sind SSDs viel schneller
im lesen und schreiben von Daten, in der Regel f&uuml;nf Fach schneller. Durch diese Schnelligkeit ist es ratsam das Betriebssystem auf der SSD und die
weniger ben&ouml;tigen Dateien auf der HDD zu speichern.
Das einzige Manko ist der Preis. F&uuml;r eine 1 TByte Festplatte zahlt man als HDD 50 und als SSD 360 Euro.
</p>
<br>
<p id="f&uuml;nf"><strong>Geschichte der Festplatte     </strong><br>   <br>

Der Weg der Festplatte begann vor &uuml;ber 60 Jahren.
Im Jahre 1956 startete die Geschichte der Festplatten Produktion, als die Firma<strong> IBM </strong>ihre erste Festplatte mit der Speichergr&ouml;&szlig;e
von 5MB und einem Durchmesser von gewaltigen 61cm.

Aber die Technologie der Festplatte wurde schon im Jahre <strong>1878</strong> erfunden. Der Amerikaner <strong>Oberlin Smith</strong> versuchte Daten auf einem magnetisierten Draht
zu speichern, sowie fast in der gleichen Zeit <strong>Valdemar Poulsen,</strong> der die Idee hatte Daten magnetisch aufzuzeichnen. Daraus wurde dann ein um eine Trommel
gewickelter Stahldraht, der<strong> 1889 </strong>als Telefonarnrufbeantworter diente. Aber mehr zu der Geschichte der Datenspeicherung weiter unten, nun weiter zur Festplatte.

Es kamen immer mehr Hersteller Auff&uuml;hrung dem Markt.<strong>
1979 </strong>kam <img id="Bild"src="bilder/geschichtre bild.png" alt="" border="0" width="502" height="339">Seagate mit der ersten 5,25 Zoll Festplatte und <strong>1981</strong> kam <strong>SCSI. </strong>
Aber alle Festplatten hatten nur eine Kapazit&auml;t von 5 MB.

Erst im Jahr<strong> 1996</strong> hat <strong>Seagate</strong> eine Festplatte mit 10GB ver&ouml;ffentlicht. Darauf kam im Jahr <strong>1998 </strong>eine Kapazit&auml;t von 50GB.

Die Speicherkapazit&auml;t wurde in den Jahren immer besser und g&uuml;nstiger.
Die Fl&auml;chendichte auf den Platten stieg immer mehr, wodurch immer mehr auf engen Raum gespeichert werden konnte. Von 2000 Bit/inch2
 im Jahr<strong> 1957 </strong>bis zu 60GB/inch2. Und es sind noch h&ouml;here Werte in naher Zukunft zu erwarten.

Im Jahr <strong>2005</strong> wurde eine neue H&ouml;chst Marke geknackt.
Hitachi stellte erstmals eine 500GB Festplatte vor.

Im Laufe der Jahre gab es 220 Firmen die Festplatten verkauften, aber davon haben bis heute nur noch Seagate, Toshiba und Western Digital &uuml;berlebt.

Im Moment liegt die maximale Speicherkapazit&auml;t bei 20TB. Seagate plant f&uuml;r <strong>2026 </strong>ein Festplatte zu bauen, die 60TB besitzt. </p>
                 <br> <p id="sechs"> <strong>Geschichte der Datenspeicherung vor der Festplatte  </strong><br> <br>

<strong>1. Lochkarten </strong>
Die erste Technologie zum Datenspeichern<img id="Bild"src="bilder/Lochkatrte.png" alt="" border="0" width="300" height="150"> f&uuml;r Computer.
Die Lockkarten Technologie von <strong>Herman Hollerith </strong>wurde <strong>1890</strong> f&uuml;r eine Volksz&auml;hlung in den USA genutzt. Und im Jahr <strong>1937 </strong>produzierte
IBM 10 Millionen Lochkarten t&auml;glich.
Es war ein Papier, das maschinell oder auch per Hand gekocht wurde und der Computer konnte dann anhand der Position des Loches digitale Informationen darstellen.
 <br> <br>
<strong>2. Magnetband </strong>
Ende der <strong>1960er-Jahre</strong> wurde das <img id="Bild"src="bilder/Magnetband.png" alt="" border="0" width="300" height="150">Magnetband eingef&uuml;hrt. Es konnte<strong> 10.000 mal</strong> so viel speichern wie eine Lochkarte und das revolution&auml;re
war, dass man das Magnetband wieder verwenden und neu beschreiben konnte. Anders als bei der Lochkarte, wenn einmal ein Loch war, dann
war f&uuml;r immer ein Loch. Durch diese Entdeckung wurden sie auch erstmalig f&uuml;r <strong>Privatzwecke </strong>benutzt. Die <strong>Kassette</strong> basiert auch auf diese Technologie,
ist aber heute auch schon veraltet.
   <br>  <br>
<strong>3. Festplatte  </strong>
Jetzt kommt unsere Festplatte. <img id="Bild"src="bilder/Festplatte ge.png" alt="" border="0" width="300" height="150">Sie wurde <strong>1956 </strong>  auf den Markt gebracht und h&auml;lt bis heute immer noch mit.
Das IBM 350 Speicherlaufwerk war Teil des 305 RAMAC-Computers und war so gro&szlig; wie ein Wohnzimmerschrank.
Das Gewicht betrug fast eine Tonne und es war so<strong> laut</strong>, das man es nur mit Geh&ouml;rschutz in Betrieb nehmen konnte.
Mehr zu der Geschichte der Festplatte <strong>OBEN.</strong>
    <br> <br>
<strong>4. Diskette </strong>
Die Diskette wurde <strong>1969 </strong>wieder von IBM auf <img id="Bild"src="bilder/Diskette.jpg" alt="" border="0" width="300" height="200">den Markt gebracht und hatte eine Speichergr&ouml;&szlig;e von 80KB.
Diese 8-Zoll-Diskette konnte nur gelesen werden, was sich aber mit der <strong>1973</strong> rauskommende verbesserte.
Diese konnte nun auch 256 kB speichern und war im Gegensatz zu den anderen Datenspeicher flach und die Daten waren nicht mehr auf Rollen gespeichert.

Die Disketten wurden immer effizienter, kleiner und hatten auch eine gr&ouml;&szlig;ere Speicherkapazit&auml;t.
Die 3,5 Zoll-Disk von <strong>1990</strong> konnte 250 MB speichern und war viel <strong>flexibler</strong> und <strong>g&uuml;nstiger </strong>als die damaligen Festplatten.
      <br> <br>
<strong>4. CD/DVD </strong>
Im Jahr <strong>1979</strong> erfanden Phillips<img id="Bild"src="bilder/CD.png" alt="" border="0" width="300" height="200"> und Sony gemeinsam die digitale Audiodisk, die heutzutage nicht mehr so h&auml;ufig genutzte.
Damals war sie eine neue Generation der Datenspeicherung.
Die Diskette geh&ouml;rte nun zu der Vergangenheit. CDs wurden aber meist nur von Firmen zur Sicherung von Daten genutzt,
als aber der Preis von CDs sank w&uuml;rde er auch f&uuml;r den Privaten Sektor bekannt. Sie konnten bis zu 900MB an Daten speichern,
das sind <strong>500.000</strong> Seiten Text im A4 Format.Im Jahr <strong>2001 </strong>kam nach der CD die DVD und darauf die Blu-ray, die stolze 50GB speichern kann.
     <br> <br>
<strong>5. Flash-Laufwerke </strong>
Anfang des <strong>21.Jahrhundertskamen </strong>die USB-Sticks, diese Technologie ist auch in SSDs eingebaut.
    <br>  <br>
<strong>6. Cloud   </strong>
Die <strong>Cloud</strong> ist eine ganz neue <img id="Bild"src="bilder/Cloud.png" alt="" border="0" width="300" height="150">Dimension der Datenspeicherung. <br>Man kann unendlich Daten speichern, <br>
aber es wird auf der Cloud und nicht auf dem Ger&auml;t gespeichert, <br>wodurch man keine Probleme mit der Festplatte </p>

</body>
</html>